import { Button } from "@/components/ui/button";
import Link from "next/link";

export default async function Home() {
  return (
    <main className="flex flex-col gap-3 sm:gap-4 justify-center items-center min-h-[calc(100vh-80px)] px-4 py-6 pb-24 sm:pb-0 sm:py-8 text-center overflow-y-auto">
      <h1 className="text-xl sm:text-2xl md:text-3xl leading-relaxed text-balance">
        ارزیابی آمادگی دیجیتال
      </h1>

      <p className="text-sm sm:text-base text-justify w-full max-w-2xl leading-8">
        تحول دیجیتال به یکی از مهم‌ترین الزامات ارتقای بهره‌وری، پایداری و تاب
        آوری در صنعت انرژی تبدیل شده است. درحال حاضر صنعت انرژی با مسائل و
        مشکلات متعددی مواجه است و بهره‌گیری از فناوری‌های دیجیتال، سامانه‌های
        هوشمند، تحلیل داده، اینترنت اشیا و ابزارهای تصمیم‌یار می‌تواند نقش مؤثری
        در مدیریت این چالش‌ها، پاسخگویی به مشکلات، کاهش هزینه‌ها، کنترل ریسک‌ها
        و بهبود عملکرد تولید ایفا کند. با این حال، موفقیت در مسیر تحول دیجیتال
        مستلزم شناخت دقیق میزان آمادگی از جنبه‌های مدیریتی، فرایندی، فناورانه،
        زیرساختی، انسانی و داده‌ای است. از این رو، هدف این پژوهش ارزیابی آمادگی
        دیجیتال صنعت انرژی و زیربخش‌های آن از جمله توانیر است تا نقاط قوت،
        شکاف‌ها و نیازهای توسعه‌ای این حوزه شناسایی شود. نتایج این ارزیابی
        می‌تواند مبنایی برای تدوین سیاست‌ها، برنامه‌های سرمایه‌گذاری و تشویقی،
        توسعه زیرساخت‌ها، توانمندسازی نیروی انسانی و اجرای پروژه‌های تحول
        دیجیتال اولویت‌دار در صنعت انرژی کشور فراهم سازد. نتیجه گامهای این
        پژوهش، مدل ارزیابی آمادگی دیجیتال طراحی شده در قالب هفت بعد است. در هر
        بعد نیز مولفه‌ها و شاخص‌های متناسب با آن بعد طراحی شده است که این
        پرسشنامه براساس این مدل، در هر بعد و مولفه‌های مرتبط با آن پرسشهایی را
        مطرح می‌نماید. در ادامه خواهشمندیم به منظور تحقق اهداف ذکر شده، ما را در
        تکمیل این پرسشنامه همراهی فرمایید. از حسن توجه شما سپاسگزاریم.
      </p>
      <div className="fixed bottom-0 left-0 w-full p-4 bg-neutral-100/30 dark:bg-background/50 backdrop-blur-sm sm:static sm:w-auto sm:p-0">
        <Link
          href="/industry"
          className="block w-full sm:w-auto max-w-xs mx-auto"
        >
          <Button className="w-full sm:w-auto">شروع پرسشنامه</Button>
        </Link>
      </div>
    </main>
  );
}
